# Simbols:
# ♦️♥️♣️♠️

# Visual deck

visualDeck = ["A♥️", "A♣️", "A♦️", "A♠️",
              "2♥️", "2♣️", "2♦️", "2♠️",
              "3♥️", "3♣️", "3♦️", "3♠️",
              "4♥️", "4♣️", "4♦️", "4♠️",
              "5♥️", "5♣️", "5♦️", "5♠️",
              "6♥️", "6♣️", "6♦️", "6♠️",
              "7♥️", "7♣️", "7♦️", "7♠️",
              "8♥️", "8♣️", "8♦️", "8♠️",
              "9♥️", "9♣️", "9♦️", "9♠️",
              "10♥️", "10♣️", "10♦️", "10♠️",
              "Q♥️", "Q♣️", "Q♦️", "Q♠️",
              "J♥️", "J♣️", "J♦️", "J♠️",
              "K♥️", "K♣️", "K♦️", "K♠️"]

# Logical hands
logicalPlayerHand = []
logicalDealerHand = []

# Deck backup to recreate the game
deckBackup = ["A♥️", "A♣️", "A♦️", "A♠️",
              "2♥️", "2♣️", "2♦️", "2♠️",
              "3♥️", "3♣️", "3♦️", "3♠️",
              "4♥️", "4♣️", "4♦️", "4♠️",
              "5♥️", "5♣️", "5♦️", "5♠️",
              "6♥️", "6♣️", "6♦️", "6♠️",
              "7♥️", "7♣️", "7♦️", "7♠️",
              "8♥️", "8♣️", "8♦️", "8♠️",
              "9♥️", "9♣️", "9♦️", "9♠️",
              "10♥️", "10♣️", "10♦️", "10♠️",
              "Q♥️", "Q♣️", "Q♦️", "Q♠️",
              "J♥️", "J♣️", "J♦️", "J♠️",
              "K♥️", "K♣️", "K♦️", "K♠️"]

# Making the deck cards less predictable
visualDeck *= 5

# Visual hands to display
visualPlayerHand = []
visualDealerHand = []
